[
  {
    "id": 1,
    "title": "Top 10 Study Tips for Moroccan Students",
    "category": "Study Tips",
    "author": "Dr. Sara El Amrani",
    "date": "2025-10-10",
    "preview": "Learn the best strategies to retain information and excel in your exams. From active recall to spaced repetition, discover the techniques top students use in Morocco."
  },
  {
    "id": 2,
    "title": "Complete Guide to University Admissions in Morocco",
    "category": "Admissions",
    "author": "Mohamed Benali",
    "date": "2025-10-08",
    "preview": "Everything you need to know about applying to Moroccan universities, from choosing the right program to crafting a strong personal statement."
  },
  {
    "id": 3,
    "title": "STEM Career Opportunities in Morocco 2025",
    "category": "Career Planning",
    "author": "Prof. Youssef Idrissi",
    "date": "2025-10-06",
    "preview": "Explore the fastest-growing STEM careers in Morocco and learn the skills you need to thrive in a technology-driven world."
  },
  {
    "id": 4,
    "title": "Balancing Studies and Mental Health for Moroccan Students",
    "category": "Wellness",
    "author": "Dr. Amina Chouaib",
    "date": "2025-10-04",
    "preview": "Mental health is as important as academic success. Learn practical strategies to manage stress, avoid burnout, and maintain a healthy balance during your studies."
  },
  {
    "id": 5,
    "title": "Studying Abroad: Tips for Moroccan Students",
    "category": "International",
    "author": "Khalid El Fassi",
    "date": "2025-10-02",
    "preview": "Thinking of studying abroad? Get insights on selecting the right country, preparing for cultural differences, and making the most of your international experience."
  },
  {
    "id": 6,
    "title": "Financial Aid for Moroccan Students: How to Make the Most",
    "category": "Financial Aid",
    "author": "Leila Bouziane",
    "date": "2025-10-01",
    "preview": "Learn about scholarships, loans, and work-study programs available to Moroccan students, and how to maximize your financial aid."
  }
]
